23-views-and-forms/student/puppies/app/controllers/puppies_controller.rb

  def index
    @puppies = Puppy.all
---
SELECT  "puppies".* FROM "puppies" ORDER BY "puppies"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    @puppy = Puppy.new(
      name: params[:puppy][:name],
      breed: params[:puppy][:breed],
      age: params[:puppy][:age]
    )

    @puppy.save
---
INSERT INTO "puppies" ("name", "breed", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Tim"], ["breed", "Dalmation"], ["age", 0], ["created_at", "2019-08-20 12:53:04.546006"], ["updated_at", "2019-08-20 12:53:04.546006"]]

  def show
    @puppy = Puppy.find(params[:id])
---
SELECT  "puppies".* FROM "puppies" WHERE "puppies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @puppy = Puppy.find(params[:id])
---
SELECT  "puppies".* FROM "puppies" WHERE "puppies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @puppy = Puppy.find(params[:id])

    @puppy.name = params[:puppy][:name]
    @puppy.age = params[:puppy][:age]
    @puppy.breed = params[:puppy][:breed]

    if @puppy.save
---
SELECT  "puppies".* FROM "puppies" WHERE "puppies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "puppies" SET "name" = ?, "updated_at" = ? WHERE "puppies"."id" = ?  [["name", "Sam"], ["updated_at", "2019-08-21 12:15:50.140022"], ["id", 1]]